[{"text": "Что такое Python и какие его основные особенности?", "category": "python", "correct_answer": "Python — это высокоуровневый язык программирования общего назначения. Основные особенности: простота синтаксиса, динамическая типизация, интерпретируемость, поддержка нескольких парадигм программирования (ООП, функциональное, процедурное)."}, {"text": "Что такое PEP 8?", "category": "python", "correct_answer": "PEP 8 — это руководство по стилю кода для Python. Оно содержит рекомендации по форматированию кода, именованию переменных и функций, организации импортов и т.д."}, {"text": "Что такое GIL (Global Interpreter Lock)?", "category": "python", "correct_answer": "GIL — это механизм, который ограничивает выполнение нескольких потоков в одном процессе Python. Он необходим для управления памятью в интерпретаторе CPython."}, {"text": "Как создать виртуальное окружение в Python?", "category": "python", "correct_answer": "Используя команду python -m venv myenv, где myenv — это имя виртуального окружения."}, {"text": "Что такое декораторы в Python?", "category": "python", "correct_answer": "Декораторы — это функции, которые изменяют поведение других функций или методов. Они используются для добавления функциональности без изменения исходного кода."}, {"text": "Как работает управление памятью в Python?", "category": "python", "correct_answer": "Python использует автоматическое управление памятью с помощью сборщика мусора, который освобождает память, занятую объектами, которые больше не используются."}, {"text": "Что такое list comprehension?", "category": "python", "correct_answer": "List comprehension — это синтаксическая конструкция для создания списков на основе существующих списков с использованием выражений и циклов в одной строке."}, {"text": "Как работает наследование в Python?", "category": "python", "correct_answer": "Наследование позволяет создавать новый класс на основе существующего. Новый класс (дочерний) наследует атрибуты и методы родительского класса."}, {"text": "Что такое генераторы и как они работают?", "category": "python", "correct_answer": "Генераторы — это функции, которые возвращают итераторы с помощью ключевого слова yield. Они позволяют создавать последовательности значений на лету, экономя память."}, {"text": "Как обработать исключения в Python?", "category": "python", "correct_answer": "Используя блоки try, except, else и finally. Пример:Python  try:     # код, который может вызвать исключение except SomeException as e:     # обработка исключения else:     # код, который выполнится, если исключений не было finally:     # код, который вып"}, {"text": "Что такое lambda-функции?", "category": "python", "correct_answer": "Lambda-функции — это анонимные функции, которые создаются с помощью ключевого слова lambda. Они могут содержать только одно выражение."}, {"text": "Как работает модуль collections?", "category": "python", "correct_answer": "Модуль collections предоставляет специализированные контейнеры данных, такие как deque, Counter, OrderedDict, defaultdict и namedtuple."}, {"text": "Что такое модуль itertools?", "category": "python", "correct_answer": "Модуль itertools предоставляет функции для создания итераторов для эффективной работы с циклами, такие как count, cycle, repeat, chain, combinations, permutations."}, {"text": "Как работает модуль functools?", "category": "python", "correct_answer": "Модуль functools предоставляет функции для работы с функциями и методами, такие как partial, reduce, lru_cache, singledispatch."}, {"text": "Что такое __init__.py?", "category": "python", "correct_answer": "__init__.py — это файл, который делает директорию пакетом Python. Он может быть пустым или содержать код инициализации пакета."}, {"text": "Как работает модуль datetime?", "category": "python", "correct_answer": "Модуль datetime предоставляет классы для работы с датами и временем, такие как datetime, date, time, timedelta."}, {"text": "Что такое self в методах класса?", "category": "python", "correct_answer": "self — это ссылка на экземпляр класса. Он используется для доступа к атрибутам и методам класса изнутри его методов."}, {"text": "Как создать и использовать классы в Python?", "category": "python", "correct_answer": "Классы создаются с помощью ключевого слова class. Пример: Python  class MyClass:     def __init__(self, value):         self.value = value     def method(self):         return self.value"}, {"text": "Что такое метаклассы в Python?", "category": "python", "correct_answer": "Метаклассы — это классы, которые определяют поведение других классов. Они используются для создания классов с определенными свойствами и поведением."}, {"text": "Как работает модуль re?", "category": "python", "correct_answer": "Модуль re предоставляет функции для работы с регулярными выражениями, такие как match, search, findall, sub."}, {"text": "Что такое __name__ == \"__main__\"?", "category": "python", "correct_answer": "Это условие используется для проверки, запущен ли скрипт напрямую или импортирован как модуль. Если скрипт запущен напрямую, блок кода под этим условием будет выполнен."}, {"text": "Как работает модуль os?", "category": "python", "correct_answer": "Модуль os предоставляет функции для работы с операционной системой, такие как управление файлами и директориями, получение информации о системе, выполнение команд."}, {"text": "Что такое __repr__ и __str__?", "category": "python", "correct_answer": "__repr__ возвращает строковое представление объекта для разработчиков, а __str__ — для пользователей. Пример: Python  class MyClass:     def __repr__(self):         return \"MyClass()\"     def __str__(self):         return \"Instance of MyClass\""}, {"text": "Как работает модуль json?", "category": "python", "correct_answer": "Модуль json предоставляет функции для кодирования и декодирования данных в формате JSON, такие как dump, dumps, load, loads."}, {"text": "Что такое @staticmethod и @classmethod?", "category": "python", "correct_answer": "@staticmethod определяет статический метод, который не принимает параметр self. @classmethod определяет метод класса, который принимает параметр cls."}, {"text": "Как работает модуль logging?", "category": "python", "correct_answer": "Модуль logging предоставляет функции для ведения журнала событий, такие как debug, info, warning, error, critical."}, {"text": "Что такое __slots__?", "category": "python", "correct_answer": "__slots__ ограничивает атрибуты, которые могут быть добавлены к экземпляру класса, что позволяет экономить память."}, {"text": "Как работает модуль threading?", "category": "python", "correct_answer": "Модуль threading предоставляет функции для работы с потоками, такие как создание и управление потоками, синхронизация потоков."}, {"text": "Что такое asyncio?", "category": "python", "correct_answer": "asyncio — это модуль для написания асинхронного кода с использованием корутин, событийных циклов и задач."}, {"text": "Как работает модуль unittest?", "category": "python", "correct_answer": "Модуль unittest предоставляет инструменты для написания и выполнения тестов, такие как создание тестовых случаев, наборов тестов, запуск тестов."}, {"text": "Что такое with и как он работает?", "category": "python", "correct_answer": "with используется для управления ресурсами, такими как файлы или сетевые соединения. Он гарантирует, что ресурсы будут корректно освобождены. Пример: Python  with open('file.txt', 'r') as file:     content = file.read()"}, {"text": "Как работает модуль subprocess?", "category": "python", "correct_answer": "Модуль subprocess предоставляет функции для выполнения системных команд и взаимодействия с ними, такие как run, Popen, call."}, {"text": "Что такое __dict__?", "category": "python", "correct_answer": "__dict__ — это словарь, содержащий атрибуты объекта. Он используется для динамического добавления и изменения атрибутов."}, {"text": "Как работает модуль sqlite3?", "category": "python", "correct_answer": "Модуль sqlite3 предоставляет функции для работы с базами данных SQLite, такие как создание и выполнение запросов, управление транзакциями."}, {"text": "Что такое __getitem__ и __setitem__?", "category": "python", "correct_answer": "__getitem__ и __setitem__ используются для доступа и изменения элементов объекта с помощью синтаксиса индексирования. Пример: Python  class MyClass:     def __getitem__(self, key):         return self.data[key]     def __setitem__(self, key, value):"}, {"text": "Как работает модуль hashlib?", "category": "python", "correct_answer": "Модуль hashlib предоставляет функции для создания хешей, такие как md5, sha1, sha256."}, {"text": "Что такое __call__?", "category": "python", "correct_answer": "__call__ позволяет экземпляру класса быть вызываемым как функция. Пример: Python  class MyClass:     def __call__(self, *args, **kwargs):         return sum(args) ``"}, {"text": "Что такое __iter__ и __next__?", "category": "python", "correct_answer": "__iter__ возвращает итератор объекта, а __next__ возвращает следующий элемент последовательности. Они используются для создания пользовательских итераторов."}, {"text": "Как работает модуль abc?", "category": "python", "correct_answer": "Модуль abc предоставляет инструменты для создания абстрактных базовых классов, которые могут содержать абстрактные методы, требующие реализации в подклассах."}, {"text": "Что такое __enter__ и __exit__?", "category": "python", "correct_answer": "__enter__ и __exit__ используются для управления контекстом в конструкции with. __enter__ выполняется при входе в блок with, а __exit__ — при выходе."}, {"text": "Как работает модуль multiprocessing?", "category": "python", "correct_answer": "Модуль multiprocessing предоставляет функции для создания и управления процессами, такие как Process, Queue, Pool."}, {"text": "Что такое __del__?", "category": "python", "correct_answer": "__del__ — это метод деструктора, который вызывается при удалении объекта. Он используется для освобождения ресурсов."}, {"text": "Как работает модуль socket?", "category": "python", "correct_answer": "Модуль socket предоставляет функции для работы с сетевыми соединениями, такие как создание серверов и клиентов, отправка и получение данных."}, {"text": "Что такое __new__?", "category": "python", "correct_answer": "__new__ — это метод, который создает новый экземпляр класса. Он вызывается перед __init__ и используется для управления процессом создания объектов."}, {"text": "Как работает модуль enum?", "category": "python", "correct_answer": "Модуль enum предоставляет классы для создания перечислений, которые представляют собой набор именованных значений."}, {"text": "Что такое __getattr__ и __setattr__?", "category": "python", "correct_answer": "__getattr__ вызывается при попытке доступа к несуществующему атрибуту, а __setattr__ — при установке значения атрибута. Они используются для управления доступом к атрибутам."}, {"text": "Как создать алиас для команды?", "category": "linux", "correct_answer": "Добавив строку alias <алиас>='<команда>' в файл ~/.bashrc."}, {"text": "Как работает модуль typing?", "category": "python", "correct_answer": "Модуль typing предоставляет инструменты для аннотации типов, такие как List, Dict, Union, Optional, что помогает улучшить читаемость и проверку кода."}, {"text": "Что такое __slots__?", "category": "python", "correct_answer": "__slots__ ограничивает атрибуты, которые могут быть добавлены к экземпляру класса, что позволяет экономить память."}, {"text": "Как работает модуль pathlib?", "category": "python", "correct_answer": "Модуль pathlib предоставляет объектно-ориентированный интерфейс для работы с файловыми путями, такие как создание, чтение, запись и удаление файлов и директорий."}, {"text": "Что такое Git и для чего он используется?", "category": "git", "correct_answer": "Git — это распределенная система управления версиями, используемая для отслеживания изменений в исходном коде и совместной работы над проектами."}, {"text": "Как создать новый репозиторий Git?", "category": "git", "correct_answer": "Используя команду git init, которая инициализирует новый репозиторий в текущей директории."}, {"text": "Как клонировать существующий репозиторий?", "category": "git", "correct_answer": "Используя команду git clone <URL>, где <URL> — это ссылка на удаленный репозиторий."}, {"text": "Что такое коммит в Git?", "category": "git", "correct_answer": "Коммит — это сохранение изменений в репозитории. Он фиксирует текущее состояние файлов и добавляет его в историю проекта."}, {"text": "Как создать новый коммит?", "category": "git", "correct_answer": "Используя команды git add <файл> для добавления изменений в индекс и git commit -m \"сообщение\" для создания коммита."}, {"text": "Что такое ветка в Git?", "category": "git", "correct_answer": "Ветка — это независимая линия разработки. Она позволяет работать над разными функциями или исправлениями параллельно."}, {"text": "Как создать новую ветку?", "category": "git", "correct_answer": "Используя команду git branch <имя_ветки> для создания ветки и git checkout <имя_ветки> для переключения на нее."}, {"text": "Как объединить ветки?", "category": "git", "correct_answer": "Используя команду git merge <имя_ветки>, чтобы объединить указанную ветку с текущей."}, {"text": "Как просмотреть историю коммитов?", "category": "git", "correct_answer": "Используя команду git log, которая отображает список коммитов в текущей ветке."}, {"text": "Что такое конфликт слияния и как его разрешить?", "category": "git", "correct_answer": "Конфликт слияния возникает, когда изменения в разных ветках противоречат друг другу. Его можно разрешить вручную, отредактировав конфликтующие файлы и создав новый коммит."}, {"text": "Что такое git pull и git fetch?", "category": "git", "correct_answer": "git fetch загружает изменения из удаленного репозитория, но не объединяет их с текущей веткой. git pull загружает и объединяет изменения."}, {"text": "Как отменить изменения в файле?", "category": "git", "correct_answer": "Используя команду git checkout -- <файл>, чтобы вернуть файл к последнему коммиту."}, {"text": "Как удалить файл из репозитория?", "category": "git", "correct_answer": "Используя команду git rm <файл>, чтобы удалить файл и создать коммит с удалением."}, {"text": "Что такое git stash?", "category": "git", "correct_answer": "git stash временно сохраняет изменения, не добавленные в коммит, и возвращает рабочую директорию к чистому состоянию."}, {"text": "Как применить изменения из git stash?", "category": "git", "correct_answer": "Используя команду git stash apply, чтобы восстановить сохраненные изменения."}, {"text": "Что такое git rebase?", "category": "git", "correct_answer": "git rebase перемещает или объединяет последовательность коммитов на новую базу коммитов. Это позволяет создавать более линейную историю."}, {"text": "Как отменить последний коммит?", "category": "git", "correct_answer": "Используя команду git reset --soft HEAD~1, чтобы отменить последний коммит, сохранив изменения в рабочей директории."}, {"text": "Что такое git cherry-pick?", "category": "git", "correct_answer": "git cherry-pick применяет изменения из одного конкретного коммита в текущую ветку."}, {"text": "Как создать тег в Git?", "category": "git", "correct_answer": "Используя команду git tag <имя_тега>, чтобы создать аннотированный тег."}, {"text": "Используя команду git tag <имя_тега>, чтобы создать аннотированный тег.", "category": "git", "correct_answer": "Используя команду git branch -d <имя_ветки>, чтобы удалить локальную ветку, и git push origin --delete <имя_ветки>, чтобы удалить удаленную ветку."}, {"text": "Что такое git diff?", "category": "git", "correct_answer": "git diff показывает различия между рабочей директорией и индексом или между двумя коммитами."}, {"text": "Как настроить глобальные параметры Git?", "category": "git", "correct_answer": "Используя команды git config --global user.name \"Имя\" и git config --global user.email \"email@example.com\"."}, {"text": "Что такое .gitignore?", "category": "git", "correct_answer": ".gitignore — это файл, который указывает Git, какие файлы и директории следует игнорировать."}, {"text": "Как просмотреть изменения перед коммитом?", "category": "git", "correct_answer": "Используя команду git status, чтобы увидеть измененные файлы, и git diff, чтобы увидеть конкретные изменения."}, {"text": "Что такое git submodule?", "category": "git", "correct_answer": "git submodule позволяет включать и управлять репозиториями внутри другого репозитория."}, {"text": "Как обновить подмодули?", "category": "git", "correct_answer": "Используя команду git submodule update --remote, чтобы обновить подмодули до последних коммитов."}, {"text": "Что такое git blame?", "category": "git", "correct_answer": "git blame показывает, кто и когда изменил каждую строку в файле."}, {"text": "Как создать патч в Git?", "category": "git", "correct_answer": "Используя команду git format-patch, чтобы создать патч-файл из коммитов."}, {"text": "Что такое git bisect?", "category": "git", "correct_answer": "git bisect используется для поиска коммита, который ввел ошибку, путем бинарного поиска."}, {"text": "Как клонировать репозиторий с подмодулями?", "category": "git", "correct_answer": "Используя команду git clone --recurse-submodules <URL>, чтобы клонировать репозиторий и инициализировать подмодули."}, {"text": "Что такое git clean?", "category": "git", "correct_answer": "git clean удаляет неотслеживаемые файлы из рабочей директории."}, {"text": "Как изменить последний коммит?", "category": "git", "correct_answer": "Используя команду git commit --amend, чтобы изменить сообщение последнего коммита или добавить изменения."}, {"text": "Что такое git hook?", "category": "git", "correct_answer": "git hook — это сценарии, которые выполняются при определенных действиях в репозитории, таких как коммит или слияние."}, {"text": "Как настроить удаленный репозиторий?", "category": "git", "correct_answer": "Используя команду git remote add <имя> <URL>, чтобы добавить удаленный репозиторий."}, {"text": "Что такое git tag?", "category": "git", "correct_answer": "git tag используется для создания меток на коммитах, обычно для обозначения релизов."}, {"text": "Как просмотреть удаленные ветки?", "category": "git", "correct_answer": "Используя команду git branch -r, чтобы увидеть список удаленных веток."}, {"text": "Что такое git archive?", "category": "git", "correct_answer": "git archive создает архив (например, zip или tar) из содержимого репозитория."}, {"text": "Как восстановить удаленный файл?", "category": "git", "correct_answer": "Используя команду git checkout <коммит> -- <файл>, чтобы восстановить файл из указанного коммита."}, {"text": "Что такое git reflog?", "category": "git", "correct_answer": "git reflog отслеживает все изменения в HEAD, включая те, которые не видны в обычной истории коммитов."}, {"text": "Как изменить базу ветки?", "category": "git", "correct_answer": "Используя команду git rebase <ветка>, чтобы изменить базу текущей ветки на указанную."}, {"text": "Что такое git gc?", "category": "git", "correct_answer": "git gc выполняет сборку мусора в репозитории, удаляя ненужные файлы и оптимизируя хранилище."}, {"text": "Как создать алиас для команды Git?", "category": "git", "correct_answer": "Используя команду git config --global alias.<алиас> '<команда>', чтобы создать алиас для команды."}, {"text": "Что такое git fsck?", "category": "git", "correct_answer": "git fsck проверяет целостность и валидность объектов в репозитории."}, {"text": "Как отменить изменения в индексе?", "category": "git", "correct_answer": "Используя команду git reset HEAD <файл>, чтобы удалить файл из индекса."}, {"text": "Что такое git cherry?", "category": "git", "correct_answer": "git cherry сравнивает два ветки и показывает коммиты, которые есть в одной ветке, но отсутствуют в другой."}, {"text": "Как создать пустой коммит?", "category": "git", "correct_answer": "Используя команду git commit --allow-empty -m \"сообщение\", чтобы создать коммит без изменений."}, {"text": "Что такое git shortlog?", "category": "git", "correct_answer": "git shortlog создает сводку коммитов, сгруппированных по автору."}, {"text": "git shortlog создает сводку коммитов, сгруппированных по автору.", "category": "git", "correct_answer": "Используя команду git log -p <файл>, чтобы увидеть историю изменений в файле."}, {"text": "Что такое git describe?", "category": "git", "correct_answer": "git describe показывает наиболее близкий аннотированный тег к текущему коммиту."}, {"text": "Как отменить изменения в рабочей директории?", "category": "git", "correct_answer": "Используя команду git checkout -- <файл>, чтобы вернуть файл к последнему коммиту."}, {"text": "Что такое Linux и какие его основные особенности?", "category": "linux", "correct_answer": "Linux — это операционная система с открытым исходным кодом, основанная на ядре Linux. Основные особенности: многозадачность, многопользовательская система, поддержка различных файловых систем, высокая безопасность и стабильность."}, {"text": "Как узнать текущую версию ядра Linux?", "category": "linux", "correct_answer": "Используя команду uname -r"}, {"text": "Как посмотреть список всех запущенных процессов?", "category": "linux", "correct_answer": "Используя команду ps aux или top."}, {"text": "Как завершить процесс по его PID?", "category": "linux", "correct_answer": "Используя команду kill <PID>."}, {"text": "Что такое файловая система в Linux?", "category": "linux", "correct_answer": "Файловая система — это структура, которая определяет способ хранения и организации файлов на диске. Примеры: ext4, XFS, Btrfs."}, {"text": "Как создать новый файл в Linux?", "category": "linux", "correct_answer": "Используя команду touch <имя_файла>."}, {"text": "Как изменить права доступа к файлу?", "category": "python", "correct_answer": "Используя команду chmod <права> <файл>. Пример: chmod 755 script.sh."}, {"text": "Как изменить владельца файла?", "category": "linux", "correct_answer": "Используя команду chown <пользователь>:<группа> <файл>."}, {"text": "Как посмотреть информацию о процессоре?", "category": "linux", "correct_answer": "Используя команду lscpu."}, {"text": "Что такое символические ссылки?", "category": "linux", "correct_answer": "Символические ссылки — это специальные файлы, которые указывают на другие файлы или директории. Создаются с помощью команды ln -s <цель> <ссылка>."}, {"text": "Как посмотреть содержимое файла?", "category": "linux", "correct_answer": "Используя команды cat, less, more, head, tail."}, {"text": "Как найти файл в системе?", "category": "linux", "correct_answer": "Используя команду find <директория> -name <имя_файла>."}, {"text": "Как посмотреть текущий каталог?", "category": "linux", "correct_answer": "Используя команду pwd."}, {"text": "Как перейти в другой каталог?", "category": "linux", "correct_answer": "Используя команду cd <путь>."}, {"text": "Как создать новую директорию?", "category": "linux", "correct_answer": "Используя команду mkdir <имя_директории>."}, {"text": "Как удалить файл или директорию?", "category": "linux", "correct_answer": "Используя команду rm <файл> для удаления файла и rm -r <директория> для удаления директории."}, {"text": "Что такое пакетный менеджер и какие они бывают?", "category": "linux", "correct_answer": "Пакетный менеджер — это инструмент для установки, обновления и удаления программ. Примеры: apt (Debian/Ubuntu), yum (RHEL/CentOS), dnf (Fedora)."}, {"text": "Как установить пакет с помощью apt?", "category": "linux", "correct_answer": "Используя команду sudo apt install <имя_пакета>."}, {"text": "Как обновить все установленные пакеты?", "category": "linux", "correct_answer": "Используя команду sudo apt update && sudo apt upgrade."}, {"text": "Как посмотреть информацию о системе?", "category": "linux", "correct_answer": "Используя команду uname -a для общей информации и lsb_release -a для информации о дистрибутиве."}, {"text": "Как посмотреть использование дискового пространства?", "category": "linux", "correct_answer": "Используя команду df -h."}, {"text": "Как посмотреть использование памяти?", "category": "linux", "correct_answer": "Используя команду free -h."}, {"text": "Как создать архив и распаковать его?", "category": "linux", "correct_answer": "Используя команды tar -czvf archive.tar.gz <директория> для создания архива и tar -xzvf archive.tar.gz для распаковки."}, {"text": "Как посмотреть сетевые интерфейсы?", "category": "linux", "correct_answer": "Используя команду ifconfig или ip addr."}, {"text": "Как настроить статический IP-адрес?", "category": "linux", "correct_answer": "Изменив конфигурационный файл сети, например, /etc/network/interfaces или /etc/netplan/*.yaml, и перезапустив сетевой сервис."}, {"text": "Как проверить подключение к серверу?", "category": "linux", "correct_answer": "Используя команду ping <адрес>."}, {"text": "Используя команду ping <адрес>.", "category": "linux", "correct_answer": "Используя команду scp <файл> <пользователь>@<сервер>:<путь>."}, {"text": "Что такое SSH и как его использовать?", "category": "linux", "correct_answer": "SSH (Secure Shell) — это протокол для безопасного удаленного доступа к серверам. Используется командой ssh <пользователь>@<сервер>."}, {"text": "Как создать SSH-ключ?", "category": "linux", "correct_answer": "Используя команду ssh-keygen."}, {"text": "Как добавить SSH-ключ на сервер?", "category": "linux", "correct_answer": "Скопировав содержимое файла ~/.ssh/id_rsa.pub в файл ~/.ssh/authorized_keys на сервере."}, {"text": "Как посмотреть логи системы?", "category": "linux", "correct_answer": "Используя команду journalctl или просмотрев файлы в директории /var/log."}, {"text": "Как перезагрузить или выключить систему?", "category": "linux", "correct_answer": "Используя команды sudo reboot для перезагрузки и sudo shutdown now для выключения."}, {"text": "Как управлять службами в Linux?", "category": "linux", "correct_answer": "Используя команды systemctl start|stop|restart|status <служба>."}, {"text": "Что такое cron и как его использовать?", "category": "linux", "correct_answer": "Cron — это планировщик задач, который позволяет выполнять команды по расписанию. Задачи настраиваются в файле crontab с помощью команды crontab -e."}, {"text": "Как посмотреть текущие задачи cron?", "category": "linux", "correct_answer": "Используя команду crontab -l."}, {"text": "Как настроить переменные окружения?", "category": "linux", "correct_answer": "Добавив их в файл ~/.bashrc или /etc/environment."}, {"text": "Как посмотреть открытые порты?", "category": "linux", "correct_answer": "Используя команду netstat -tuln или ss -tuln."}, {"text": "Как ограничить доступ к файлу?", "category": "linux", "correct_answer": "Используя команду chmod для изменения прав доступа и chown для изменения владельца."}, {"text": "Как создать пользователя?", "category": "linux", "correct_answer": "Используя команду sudo adduser <имя_пользователя>."}, {"text": "Как удалить пользователя?", "category": "linux", "correct_answer": "Используя команду sudo deluser <имя_пользователя>."}, {"text": "Как добавить пользователя в группу?", "category": "linux", "correct_answer": "Используя команду sudo usermod -aG <группа> <имя_пользователя>."}, {"text": "Как посмотреть информацию о пользователе?", "category": "linux", "correct_answer": "Используя команду id <имя_пользователя>."}, {"text": "Как изменить пароль пользователя?", "category": "linux", "correct_answer": "Используя команду passwd <имя_пользователя>."}, {"text": "Как посмотреть историю команд?", "category": "linux", "correct_answer": "Используя команду history."}, {"text": "Как выполнить команду от имени другого пользователя?", "category": "linux", "correct_answer": "Используя команду sudo <команда>."}, {"text": "Как настроить файрвол в Linux?", "category": "linux", "correct_answer": "Используя утилиты iptables или ufw (Uncomplicated Firewall)."}, {"text": "Как проверить доступность порта?", "category": "linux", "correct_answer": "Используя команду telnet <адрес> <порт> или nc -zv <адрес> <порт>."}, {"text": "Как посмотреть информацию о памяти?", "category": "linux", "correct_answer": "Используя команду cat /proc/meminfo."}, {"text": "Как посмотреть информацию о дисках?", "category": "linux", "correct_answer": "Используя команду lsblk."}, {"text": "Что такое алгоритм?", "category": "data_structures", "correct_answer": "Алгоритм — это последовательность шагов или инструкций для решения задачи или выполнения определенной операции."}, {"text": "Что такое структура данных?", "category": "data_structures", "correct_answer": "Структура данных — это способ организации и хранения данных для эффективного доступа и модификации."}, {"text": "Какие основные типы структур данных ты знаешь?", "category": "data_structures", "correct_answer": "Основные типы структур данных: массивы, списки, стеки, очереди, деревья, графы, хеш-таблицы."}, {"text": "Что такое массив?", "category": "data_structures", "correct_answer": "Массив — это структура данных, которая хранит элементы одного типа в непрерывной области памяти."}, {"text": "Что такое связанный список?", "category": "data_structures", "correct_answer": "Связанный список — это структура данных, состоящая из узлов, где каждый узел содержит данные и ссылку на следующий узел."}, {"text": "Что такое стек?", "category": "data_structures", "correct_answer": "Стек — это структура данных, работающая по принципу LIFO (Last In, First Out), где последний добавленный элемент извлекается первым."}, {"text": "Что такое очередь?", "category": "data_structures", "correct_answer": "Очередь — это структура данных, работающая по принципу FIFO (First In, First Out), где первый добавленный элемент извлекается первым."}, {"text": "Что такое дерево?", "category": "data_structures", "correct_answer": "Дерево — это иерархическая структура данных, состоящая из узлов, где каждый узел имеет родительский узел и ноль или более дочерних узлов."}, {"text": "Что такое бинарное дерево поиска (BST)?", "category": "data_structures", "correct_answer": "BST — это бинарное дерево, в котором для каждого узла все элементы в левом поддереве меньше, а в правом поддереве больше значения узла."}, {"text": "Что такое граф?", "category": "data_structures", "correct_answer": "Граф — это структура данных, состоящая из вершин (узлов) и ребер (связей) между ними."}, {"text": "Что такое хеш-таблица?", "category": "data_structures", "correct_answer": "Хеш-таблица — это структура данных, которая использует хеш-функцию для преобразования ключей в индексы массива, что позволяет быстро находить значения по ключам."}, {"text": "Что такое хеш-функция?", "category": "data_structures", "correct_answer": "Хеш-функция — это функция, которая преобразует входные данные (ключ) в фиксированный размер (хеш-значение), используемое для индексации в хеш-таблице."}, {"text": "Что такое коллизия в хеш-таблице и как ее разрешить?", "category": "data_structures", "correct_answer": "Коллизия возникает, когда два ключа имеют одинаковое хеш-значение. Методы разрешения: цепочки (chaining) и открытая адресация (open addressing)."}, {"text": "Что такое сортировка пузырьком (Bubble Sort)?", "category": "data_structures", "correct_answer": "Bubble Sort — это простой алгоритм сортировки, который многократно проходит по списку, сравнивая и обменивая соседние элементы, если они находятся в неправильном порядке."}, {"text": "Что такое быстрая сортировка (Quick Sort)?", "category": "data_structures", "correct_answer": "Quick Sort — это алгоритм сортировки, который использует метод “разделяй и властвуй”, выбирая опорный элемент и разделяя список на две части, сортируя их рекурсивно."}, {"text": "Что такое сортировка слиянием (Merge Sort)?", "category": "data_structures", "correct_answer": "Merge Sort — это алгоритм сортировки, который рекурсивно делит список на две половины, сортирует их и затем сливает обратно в отсортированный список."}, {"text": "Что такое поиск бинарного дерева (Binary Search)?", "category": "data_structures", "correct_answer": "Binary Search — это алгоритм поиска, который работает на отсортированном массиве, многократно деля массив пополам и сравнивая средний элемент с искомым значением."}, {"text": "Что такое алгоритм Дейкстры?", "category": "data_structures", "correct_answer": "Алгоритм Дейкстры — это алгоритм поиска кратчайшего пути в графе с неотрицательными весами ребер."}, {"text": "Что такое алгоритм A?*", "category": "data_structures", "correct_answer": "A* — это алгоритм поиска пути, который использует эвристическую функцию для оценки стоимости пути и находит оптимальный путь в графе."}, {"text": "Что такое алгоритм Крускала?", "category": "data_structures", "correct_answer": "Алгоритм Крускала — это алгоритм для нахождения минимального остовного дерева в графе, который добавляет ребра в порядке возрастания их веса, избегая циклов."}, {"text": "Что такое алгоритм Прима?", "category": "data_structures", "correct_answer": "Алгоритм Прима — это алгоритм для нахождения минимального остовного дерева в графе, который начинает с одной вершины и добавляет минимальные ребра, соединяющие новые вершины."}, {"text": "Что такое алгоритм Флойда-Уоршелла?", "category": "data_structures", "correct_answer": "Алгоритм Флойда-Уоршелла — это алгоритм для нахождения кратчайших путей между всеми парами вершин в графе."}, {"text": "Что такое алгоритм Беллмана-Форда?", "category": "data_structures", "correct_answer": "Алгоритм Беллмана-Форда — это алгоритм для нахождения кратчайших путей в графе, который может содержать ребра с отрицательными весами."}, {"text": "Что такое обход в глубину (DFS)?", "category": "data_structures", "correct_answer": "DFS — это алгоритм обхода графа, который идет как можно глубже по каждому пути перед возвратом и продолжением с других путей."}, {"text": "Что такое обход в ширину (BFS)?", "category": "data_structures", "correct_answer": "BFS — это алгоритм обхода графа, который исследует все вершины на текущем уровне перед переходом на следующий уровень."}, {"text": "Что такое балансировка дерева?", "category": "data_structures", "correct_answer": "Балансировка дерева — это процесс поддержания дерева в таком состоянии, чтобы его высота была минимальной, что обеспечивает эффективный доступ к элементам."}, {"text": "Что такое красно-черное дерево?", "category": "data_structures", "correct_answer": "Красно-черное дерево — это самобалансирующееся бинарное дерево поиска, в котором каждый узел имеет цвет (красный или черный) и соблюдаются определенные правила для поддержания баланса."}, {"text": "Что такое AVL-дерево?", "category": "data_structures", "correct_answer": "AVL-дерево — это самобалансирующееся бинарное дерево поиска, в котором для каждого узла разница высот левого и правого поддеревьев не превышает 1."}, {"text": "Что такое куча (Heap)?", "category": "data_structures", "correct_answer": "Куча — это структура данных, представляющая собой полное бинарное дерево, в котором каждый узел удовлетворяет свойству кучи (максимальной или минимальной)."}, {"text": "Что такое сортировка кучей (Heap Sort)?", "category": "data_structures", "correct_answer": "Heap Sort — это алгоритм сортировки, который использует структуру данных куча для упорядочивания элементов."}, {"text": "Что такое динамическое программирование?", "category": "data_structures", "correct_answer": "Динамическое программирование — это метод решения задач, который разбивает задачу на подзадачи, решает их и сохраняет результаты для использования в дальнейшем."}, {"text": "Что такое жадные алгоритмы?", "category": "data_structures", "correct_answer": "Жадные алгоритмы — это алгоритмы, которые принимают локально оптимальные решения на каждом шаге с целью найти глобально оптимальное решение."}, {"text": "Что такое рекурсия?", "category": "data_structures", "correct_answer": "Рекурсия — это метод решения задач, при котором функция вызывает саму себя для решения подзадач."}, {"text": "Что такое мемоизация?", "category": "data_structures", "correct_answer": "Мемоизация — это техника оптимизации, при которой результаты вызовов функции сохраняются и используются повторно для предотвращения повторных вычислений."}, {"text": "Что такое хеширование?", "category": "data_structures", "correct_answer": "Хеширование — это процесс преобразования данных в фиксированный размер (хеш-значение) с помощью хеш-функции для быстрого поиска и доступа к данным."}, {"text": "Что такое граф с взвешенными ребрами?", "category": "data_structures", "correct_answer": "Граф с взвешенными ребрами — это граф, в котором каждому ребру присвоен вес (стоимость), который может представлять расстояние, время или другие метрики."}, {"text": "Что такое ориентированный граф?", "category": "data_structures", "correct_answer": "Ориентированный граф — это граф, в котором ребра имеют направление, указывающее от одной вершины к другой."}, {"text": "Что такое неориентированный граф?", "category": "data_structures", "correct_answer": "Неориентированный граф — это граф, в котором ребра не имеют направления и могут быть пройдены в обоих направлениях."}, {"text": "Что такое цикл в графе?", "category": "data_structures", "correct_answer": "Цикл — это путь в графе, который начинается и заканчивается в одной и той же вершине, проходя через другие вершины только один раз."}, {"text": "Что такое топологическая сортировка?", "category": "data_structures", "correct_answer": "Топологическая сортировка — это линейное упорядочение вершин ориентированного ациклического графа (DAG), при котором для каждого ребра (u, v) вершина u предшествует вершине v."}, {"text": "Что такое NP-полные задачи?", "category": "data_structures", "correct_answer": "NP-полные задачи — это класс задач, для которых нет известных полиномиальных алгоритмов решения, но решение можно проверить за полиномиальное время."}, {"text": "Что такое жадный алгоритм для задачи о рюкзаке?", "category": "data_structures", "correct_answer": "Жадный алгоритм для задачи о рюкзаке выбирает предметы на основе их стоимости на единицу веса, добавляя их в рюкзак до тех пор, пока не достигнет максимального веса."}, {"text": "Что такое алгоритм Кана?", "category": "data_structures", "correct_answer": "Алгоритм Кана используется для топологической сортировки ориентированного ациклического графа (DAG). Он удаляет вершины с нулевой степенью входа и повторяет процесс для оставшихся вершин."}, {"text": "Что такое алгоритм Флойда-Уоршелла?", "category": "data_structures", "correct_answer": "Алгоритм Флойда-Уоршелла находит кратчайшие пути между всеми парами вершин в графе с положительными или отрицательными весами ребер (но без отрицательных циклов)."}, {"text": "Что такое алгоритм Беллмана-Форда?", "category": "data_structures", "correct_answer": "Алгоритм Беллмана-Форда находит кратчайшие пути от одной вершины до всех остальных в графе, который может содержать ребра с отрицательными весами."}, {"text": "Что такое алгоритм Крускала?", "category": "data_structures", "correct_answer": "Алгоритм Крускала находит минимальное остовное дерево в графе, добавляя ребра в порядке возрастания их веса и избегая циклов."}, {"text": "Что такое алгоритм Прима?", "category": "data_structures", "correct_answer": "Алгоритм Прима находит минимальное остовное дерево, начиная с одной вершины и добавляя минимальные ребра, соединяющие новые вершины."}, {"text": "Что такое SQL?", "category": "sql", "correct_answer": "SQL (Structured Query Language) — это язык для управления и манипулирования реляционными базами данных."}, {"text": "Что такое реляционная база данных?", "category": "sql", "correct_answer": "Реляционная база данных — это база данных, в которой данные организованы в таблицы, связанные между собой с помощью ключей."}, {"text": "Что такое первичный ключ?", "category": "sql", "correct_answer": "Первичный ключ — это уникальный идентификатор записи в таблице. Он не может содержать NULL и должен быть уникальным для каждой записи."}, {"text": "Что такое внешний ключ?", "category": "sql", "correct_answer": "Внешний ключ — это поле в таблице, которое ссылается на первичный ключ другой таблицы, создавая связь между таблицами."}, {"text": "Что такое индекс в SQL?", "category": "sql", "correct_answer": "Индекс — это структура данных, которая улучшает скорость выполнения запросов к базе данных за счет быстрого доступа к строкам таблицы."}, {"text": "Как создать таблицу в SQL?", "category": "sql", "correct_answer": "Используя команду CREATE TABLE. Пример"}, {"text": "Как вставить данные в таблицу?", "category": "sql", "correct_answer": "Используя команду INSERT INTO"}, {"text": "Как обновить данные в таблице?", "category": "sql", "correct_answer": "Используя команду UPDATE."}, {"text": "Как удалить данные из таблицы?", "category": "sql", "correct_answer": "Используя команду DELETE. Пример: DELETE FROM users WHERE id = 1;"}, {"text": "Как выбрать данные из таблицы?", "category": "sql", "correct_answer": "Используя команду SELECT. Пример: SELECT * FROM users;"}, {"text": "Что такое JOIN в SQL?", "category": "sql", "correct_answer": "JOIN — это операция, которая объединяет строки из двух или более таблиц на основе связанного столбца."}, {"text": "Какие типы JOIN существуют?", "category": "sql", "correct_answer": "Основные типы JOIN: INNER JOIN, LEFT JOIN, RIGHT JOIN, FULL OUTER JOIN."}, {"text": "Что такое INNER JOIN?", "category": "sql", "correct_answer": "INNER JOIN возвращает строки, которые имеют совпадающие значения в обеих таблицах."}, {"text": "Что такое LEFT JOIN?", "category": "sql", "correct_answer": "LEFT JOIN возвращает все строки из левой таблицы и совпадающие строки из правой таблицы. Если совпадений нет, возвращаются NULL."}, {"text": "Что такое RIGHT JOIN?", "category": "sql", "correct_answer": "RIGHT JOIN возвращает все строки из правой таблицы и совпадающие строки из левой таблицы. Если совпадений нет, возвращаются NULL."}, {"text": "Что такое FULL OUTER JOIN?", "category": "sql", "correct_answer": "FULL OUTER JOIN возвращает все строки, когда есть совпадение в одной из таблиц. Если совпадений нет, возвращаются NULL."}, {"text": "Что такое GROUP BY?", "category": "sql", "correct_answer": "GROUP BY группирует строки с одинаковыми значениями в указанных столбцах и позволяет выполнять агрегатные функции на каждой группе."}, {"text": "Что такое HAVING?", "category": "sql", "correct_answer": "HAVING используется для фильтрации групп, созданных с помощью GROUP BY, на основе условий."}, {"text": "Что такое ORDER BY?", "category": "sql", "correct_answer": "ORDER BY используется для сортировки результатов запроса по одному или нескольким столбцам."}, {"text": "Что такое LIMIT?", "category": "sql", "correct_answer": "LIMIT используется для ограничения количества возвращаемых строк в результате запроса."}, {"text": "Что такое подзапрос (subquery)?", "category": "sql", "correct_answer": "Подзапрос — это запрос, вложенный в другой запрос. Он может использоваться в SELECT, INSERT, UPDATE или DELETE."}, {"text": "Что такое агрегатные функции?", "category": "sql", "correct_answer": "Агрегатные функции выполняют вычисления на наборе значений и возвращают одно значение. Примеры: COUNT, SUM, AVG, MAX, MIN."}, {"text": "Как использовать функцию COUNT?", "category": "sql", "correct_answer": "COUNT возвращает количество строк, соответствующих условию"}, {"text": "Как использовать функцию SUM?", "category": "sql", "correct_answer": "SUM возвращает сумму значений в столбце."}, {"text": "Как использовать функцию AVG?", "category": "sql", "correct_answer": "AVG возвращает среднее значение в столбце."}, {"text": "Как использовать функцию MAX?", "category": "sql", "correct_answer": "MAX возвращает максимальное значение в столбце."}, {"text": "Как использовать функцию MIN?", "category": "sql", "correct_answer": "MIN возвращает минимальное значение в столбце."}, {"text": "Что такое транзакция в SQL?", "category": "sql", "correct_answer": "Транзакция — это последовательность операций, выполняемых как единое целое. Она может быть зафиксирована (COMMIT) или отменена (ROLLBACK)."}, {"text": "Как начать транзакцию?", "category": "sql", "correct_answer": "Используя команду BEGIN TRANSACTION."}, {"text": "Как зафиксировать транзакцию?", "category": "sql", "correct_answer": "Используя команду COMMIT."}, {"text": "Как отменить транзакцию?", "category": "sql", "correct_answer": "Используя команду ROLLBACK."}, {"text": "Что такое ACID-свойства?", "category": "sql", "correct_answer": "ACID — это набор свойств транзакций: атомарность (Atomicity), согласованность (Consistency), изолированность (Isolation), долговечность (Durability)."}, {"text": "Что такое нормализация?", "category": "sql", "correct_answer": "Нормализация — это процесс организации данных в базе данных для уменьшения избыточности и улучшения целостности данных."}, {"text": "Какие существуют нормальные формы?", "category": "sql", "correct_answer": "Основные нормальные формы: первая (1NF), вторая (2NF), третья (3NF), Бойса-Кодда (BCNF)."}, {"text": "Что такое денормализация?", "category": "sql", "correct_answer": "Денормализация — это процесс объединения таблиц для улучшения производительности за счет увеличения избыточности данных."}, {"text": "Что такое представление (view)?", "category": "sql", "correct_answer": "Представление — это виртуальная таблица, созданная на основе результата запроса. Оно не хранит данные, а отображает их из базовых таблиц."}, {"text": "Как создать представление?", "category": "sql", "correct_answer": "Используя команду CREATE VIEW."}, {"text": "Что такое хранимая процедура?", "category": "sql", "correct_answer": "Хранимая процедура — это набор SQL-инструкций, сохраненных в базе данных и выполняемых как единое целое."}, {"text": "Как создать хранимую процедуру?", "category": "sql", "correct_answer": "Используя команду CREATE PROCEDURE."}, {"text": "Что такое триггер в SQL?", "category": "sql", "correct_answer": "Триггер — это набор инструкций, который автоматически выполняется при определенных событиях в таблице, таких как INSERT, UPDATE или DELETE."}, {"text": "Как создать триггер?", "category": "sql", "correct_answer": "Используя команду CREATE TRIGGER."}, {"text": "Что такое курсор в SQL?", "category": "sql", "correct_answer": "Курсор — это механизм для построчного перебора результатов запроса. Он позволяет выполнять операции над каждой строкой результата."}, {"text": "Как создать курсор?", "category": "sql", "correct_answer": "Используя команды DECLARE, OPEN, FETCH и CLOSE."}, {"text": "Что такое индексированный просмотр (indexed view)?", "category": "sql", "correct_answer": "Индексированный просмотр — это представление, для которого создан индекс, что позволяет улучшить производительность запросов к нему."}, {"text": "Что такое материализованное представление?", "category": "sql", "correct_answer": "Материализованное представление — это представление, которое хранит данные физически, а не вычисляет их при каждом запросе."}, {"text": "Как создать материализованное представление?", "category": "sql", "correct_answer": "Используя команду CREATE MATERIALIZED VIEW."}, {"text": "Что такое временная таблица?", "category": "sql", "correct_answer": "Временная таблица — это таблица, которая существует только в течение сеанса базы данных и автоматически удаляется после его завершения."}, {"text": "Как создать временную таблицу?", "category": "sql", "correct_answer": "Используя команду CREATE TEMPORARY TABLE."}, {"text": "Что такое Docker и для чего он используется?", "category": "docker", "correct_answer": "Docker — это платформа для разработки, доставки и запуска приложений в контейнерах. Контейнеры позволяют изолировать приложения и их зависимости для обеспечения их работы в любом окружении."}, {"text": "Что такое контейнер в Docker?", "category": "docker", "correct_answer": "Контейнер — это изолированная среда, в которой выполняется приложение вместе со всеми его зависимостями."}, {"text": "Что такое образ Docker?", "category": "docker", "correct_answer": "Образ Docker — это шаблон, из которого создаются контейнеры. Он содержит все необходимое для запуска приложения, включая код, библиотеки и зависимости."}, {"text": "Как создать образ Docker?", "category": "docker", "correct_answer": "Используя команду docker build и Dockerfile."}, {"text": "Что такое Dockerfile?", "category": "docker", "correct_answer": "Dockerfile — это текстовый файл, содержащий инструкции для создания образа Docker."}, {"text": "Как запустить контейнер Docker?", "category": "docker", "correct_answer": "Используя команду docker run. Пример: docker run -d -p 80:80 myapp"}, {"text": "Что такое Docker Hub?", "category": "docker", "correct_answer": "Docker Hub — это облачный реестр, где можно хранить и делиться образами Docker."}, {"text": "Как загрузить образ в Docker Hub?", "category": "docker", "correct_answer": "Используя команды docker login, docker tag и docker push. Пример:"}, {"text": "Как посмотреть запущенные контейнеры?", "category": "docker", "correct_answer": "Используя команду docker ps."}, {"text": "Как остановить контейнер?", "category": "docker", "correct_answer": "Используя команду docker stop <container_id>."}, {"text": "Как удалить контейнер?", "category": "docker", "correct_answer": "Используя команду docker rm <container_id>."}, {"text": "Как удалить образ Docker?", "category": "docker", "correct_answer": "Используя команду docker rmi <image_id>."}, {"text": "Что такое Docker Compose?", "category": "docker", "correct_answer": "Docker Compose — это инструмент для определения и управления многоконтейнерными Docker-приложениями с помощью файла docker-compose.yml."}, {"text": "Как запустить приложение с Docker Compose?", "category": "docker", "correct_answer": "Используя команду docker-compose up."}, {"text": "Как остановить приложение с Docker Compose?", "category": "docker", "correct_answer": "Используя команду docker-compose down."}, {"text": "Что такое Docker Volume?", "category": "docker", "correct_answer": "Docker Volume — это механизм для постоянного хранения данных, используемых контейнерами."}, {"text": "Как создать и использовать Docker Volume?", "category": "docker", "correct_answer": "Используя команды docker volume create и docker run -v."}, {"text": "Что такое Docker Network?", "category": "docker", "correct_answer": "Docker Network — это механизм для связи контейнеров друг с другом."}, {"text": "Как создать и использовать Docker Network?", "category": "docker", "correct_answer": "Используя команды docker network create и docker run --network."}, {"text": "Как посмотреть логи контейнера?", "category": "docker", "correct_answer": "Используя команду docker logs <container_id>."}, {"text": "Что такое Docker Swarm?", "category": "docker", "correct_answer": "Docker Swarm — это встроенный оркестратор контейнеров для управления кластером Docker."}, {"text": "Как инициализировать Docker Swarm?", "category": "docker", "correct_answer": "Используя команду docker swarm init."}, {"text": "Как добавить узел в кластер Docker Swarm?", "category": "docker", "correct_answer": "Используя команду docker swarm join."}, {"text": "Что такое сервис в Docker Swarm?", "category": "docker", "correct_answer": "Сервис — это абстракция, которая позволяет управлять контейнерами в кластере Docker Swarm."}, {"text": "Как создать сервис в Docker Swarm?", "category": "docker", "correct_answer": "Используя команду docker service create. Пример: docker service create --name myservice -p 80:80 myapp"}, {"text": "Как масштабировать сервис в Docker Swarm?", "category": "docker", "correct_answer": "Используя команду docker service scale. Пример: docker service scale myservice=3"}, {"text": "Что такое Kubernetes?", "category": "docker", "correct_answer": "Kubernetes — это оркестратор контейнеров с открытым исходным кодом для автоматизации развертывания, масштабирования и управления контейнерными приложениями."}, {"text": "Как Docker и Kubernetes работают вместе?", "category": "docker", "correct_answer": "Docker используется для создания и управления контейнерами, а Kubernetes — для оркестрации этих контейнеров в кластере."}, {"text": "Что такое Docker Secrets?", "category": "docker", "correct_answer": "Docker Secrets — это механизм для безопасного хранения и управления конфиденциальной информацией, такой как пароли и ключи."}, {"text": "Как создать и использовать Docker Secret?", "category": "docker", "correct_answer": "Используя команды docker secret create и docker service create --secret."}, {"text": "Что такое Docker Config?", "category": "docker", "correct_answer": "Docker Config — это механизм для управления конфигурационными файлами в контейнерах."}, {"text": "Как создать и использовать Docker Config?", "category": "docker", "correct_answer": "Используя команды docker config create и docker service create --config."}, {"text": "Что такое Dockerfile и как его использовать?", "category": "docker", "correct_answer": "Dockerfile — это текстовый файл, содержащий инструкции для создания образа Docker. Используется с командой docker build."}, {"text": "Как оптимизировать Dockerfile?", "category": "docker", "correct_answer": "Используя многослойные сборки, минимизируя количество слоев, используя кэширование и минимальные базовые образы."}, {"text": "Что такое многослойные образы в Docker?", "category": "docker", "correct_answer": "Многослойные образы состоят из нескольких слоев, каждый из которых представляет собой изменение в файловой системе. Это позволяет эффективно использовать кэширование и уменьшать размер образов."}, {"text": "Как уменьшить размер образа Docker?", "category": "docker", "correct_answer": "Используя минимальные базовые образы, удаляя временные файлы и кэш после установки зависимостей, объединяя команды RUN."}, {"text": "Что такое Docker Registry?", "category": "docker", "correct_answer": "Docker Registry — это хранилище для образов Docker, которое может быть публичным или частным."}, {"text": "Как настроить частный Docker Registry?", "category": "docker", "correct_answer": "Используя команду docker run -d -p 5000:5000 --name registry registry:2"}, {"text": "Что такое Docker Compose Override?", "category": "docker", "correct_answer": "Docker Compose Override — это механизм для переопределения настроек в файле docker-compose.override.yml, который автоматически применяется к основному файлу docker-compose.yml"}, {"text": "Как использовать переменные окружения в Docker Compose?", "category": "docker", "correct_answer": "Используя файл .env или синтаксис ${VARIABLE} в docker-compose.yml"}, {"text": "Что такое Docker Healthcheck?", "category": "docker", "correct_answer": "Docker Healthcheck — это механизм для проверки состояния контейнера с помощью команды, указанной в Dockerfile."}, {"text": "Как добавить Healthcheck в Dockerfile", "category": "docker", "correct_answer": "Используя инструкцию HEALTHCHECK. Пример:  HEALTHCHECK CMD curl --fail http://localhost:80 || exit 1"}, {"text": "Что такое Docker Context?", "category": "docker", "correct_answer": "Docker Context — это механизм для управления несколькими Docker-окружениями, такими как локальные и удаленные Docker-демоны."}, {"text": "Как создать и переключиться на другой Docker Context?", "category": "docker", "correct_answer": "Используя команды docker context create и docker context use"}, {"text": "Что такое Docker Bench for Security?", "category": "docker", "correct_answer": "Docker Bench for Security — это скрипт для проверки безопасности конфигурации Docker на основе рекомендаций CIS Docker Benchmark."}, {"text": "Как использовать Docker Bench for Security?", "category": "docker", "correct_answer": "Запустив контейнер с Docker Bench for Security."}, {"text": "Что такое Docker Slim?", "category": "docker", "correct_answer": "Docker Slim — это инструмент для уменьшения размера образов Docker и повышения их безопасности."}, {"text": "Как использовать Docker Slim?", "category": "docker", "correct_answer": "Используя команду docker-slim build. Пример: docker-slim build myapp"}, {"text": "Что такое Django?", "category": "django", "correct_answer": "Django — это высокоуровневый веб-фреймворк на языке Python, который позволяет быстро разрабатывать безопасные и поддерживаемые веб-приложения."}, {"text": "Какие основные компоненты Django?", "category": "django", "correct_answer": "Основные компоненты Django: модели (models), представления (views), шаблоны (templates), маршрутизация (URL routing), формы (forms) и админ-панель (admin)."}, {"text": "Как создать новый проект Django?", "category": "django", "correct_answer": "Используя команду django-admin startproject <имя_проекта>"}, {"text": "Как создать новое приложение в Django?", "category": "django", "correct_answer": "Используя команду python manage.py startapp <имя_приложения>"}, {"text": "Что такое модель в Django?", "category": "django", "correct_answer": "Модель — это класс, который определяет структуру данных и поведение базы данных. Модели описываются с помощью классов в файле models.py"}, {"text": "Как создать модель в Django?", "category": "django", "correct_answer": "Пример создания модели: from django.db import models  class Post(models.Model):     title = models.CharField(max_length=100)     content = models.TextField()     created_at = models.DateTimeField(auto_now_add=True)"}, {"text": "Что такое миграции в Django?", "category": "django", "correct_answer": "Миграции — это механизм для управления изменениями в структуре базы данных. Они создаются и применяются с помощью команд makemigrations и migrate"}, {"text": "Как создать и применить миграции?", "category": "django", "correct_answer": "python manage.py makemigrations python manage.py migrate"}, {"text": "Что такое админ-панель Django?", "category": "django", "correct_answer": "Админ-панель — это встроенный интерфейс для управления данными и моделями приложения. Она доступна по адресу /admin"}, {"text": "Как зарегистрировать модель в админ-панели?", "category": "django", "correct_answer": "Добавив модель в файл admin.py from django.contrib import admin from .models import Post  admin.site.register(Post)"}, {"text": "Что такое представление (view) в Django?", "category": "django", "correct_answer": "Представление — это функция или класс, который обрабатывает запросы и возвращает ответы. Представления описываются в файле views.py."}, {"text": "Как создать представление в Django?", "category": "django", "correct_answer": "Пример создания представления: from django.http import HttpResponse  def index(request):     return HttpResponse(\"Hello, world!\")"}, {"text": "Что такое шаблон (template) в Django?", "category": "django", "correct_answer": "Шаблон — это файл, который определяет структуру и оформление HTML-страницы. Шаблоны хранятся в директории templates."}, {"text": "Как использовать шаблоны в Django?", "category": "django", "correct_answer": "from django.shortcuts import render  def index(request):     return render(request, 'index.html')"}, {"text": "Что такое маршрутизация (URL routing) в Django?", "category": "django", "correct_answer": "Маршрутизация — это механизм, который связывает URL-адреса с представлениями. Маршруты описываются в файле urls.py"}, {"text": "Как настроить маршрутизацию в Django?", "category": "django", "correct_answer": "Пример настройки маршрутизации: from django.urls import path from . import views  urlpatterns = [     path('', views.index, name='index'), ]"}, {"text": "Что такое ORM в Django?", "category": "django", "correct_answer": "ORM (Object-Relational Mapping) — это механизм, который позволяет взаимодействовать с базой данных с помощью объектов Python, а не SQL-запросов."}, {"text": "Как выполнить запрос к базе данных с помощью ORM?", "category": "django", "correct_answer": "from .models import Post  posts = Post.objects.all()"}, {"text": "Что такое формы в Django?", "category": "django", "correct_answer": "Формы — это классы, которые позволяют создавать и обрабатывать HTML-формы. Формы описываются в файле forms.py"}, {"text": "Как создать форму в Django?", "category": "python", "correct_answer": "Пример создания формы: from django import forms  class PostForm(forms.Form):     title = forms.CharField(max_length=100)     content = forms.CharField(widget=forms.Textarea)"}]